Repository: oriveo/oriveo
Catalog: ios/Oriveo/Oriveo/Settings.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, id, ja, ko, pt_br, ru, th, tr, vi, zh_hans, zh_hant

source: Theme
ar: المظهر
de: Design
es: Tema
fr: Thème
hi: विषय
id: Tema
ja: テーマ
ko: 테마
pt_br: Tema
ru: Тема
th: ธีม
tr: Tema
vi: chủ đề
zh_hans: 主题
zh_hant: 主題

source: This provider has no models configured. Add at least one model first.
ar: لم يتم تكوين أي نماذج لهذا المزوّد. أضف نموذجًا واحدًا على الأقل أولاً.
de: Dieser Anbieter hat keine Modelle konfiguriert. Füge zuerst mindestens ein Modell hinzu.
es: Este proveedor no tiene modelos configurados. Agrega al menos uno primero.
fr: Ce fournisseur n'a pas de modèles configurés. Ajoutez-en au moins un d'abord.
hi: इस प्रदाता पर कोई मॉडल कॉन्फ़िगर नहीं है। पहले कम से कम एक मॉडल जोड़ें।
id: Penyedia ini belum memiliki model. Tambahkan setidaknya satu model dulu.
ja: このプロバイダーにはモデルが設定されていません。少なくとも 1 つのモデルを追加してください。
ko: 이 제공업체에는 모델이 구성되어 있지 않습니다. 먼저 모델을 하나 이상 추가해 주세요.
pt_br: Este provedor não tem modelos configurados. Adicione pelo menos um primeiro.
ru: У этого провайдера нет моделей. Сначала добавьте хотя бы одну.
th: ผู้ให้บริการนี้ยังไม่มีโมเดล โปรดเพิ่มอย่างน้อยหนึ่งโมเดลก่อน
tr: Bu sağlayıcının modeli yok. Önce en az bir model ekleyin.
vi: Nhà cung cấp này chưa cấu hình mô hình. Hãy thêm ít nhất một mô hình trước.
zh_hans: 当前服务商未配置模型，请先添加至少一个模型。
zh_hant: 目前服務商未配置模型，請先新增至少一個模型。

source: Tried %d providers, all failed.
ar: تمت تجربة %d مزوّدين، فشلوا جميعًا.
de: %d Anbieter versucht, alle fehlgeschlagen.
es: Se intentaron %d proveedores, todos fallaron.
fr: %d fournisseurs essayés, tous ont échoué.
hi: %d प्रदाताओं को आजमाया, सभी विफल रहे।
id: Mencoba %d penyedia, semua gagal.
ja: %d 個のプロバイダーを試しましたが、すべて失敗しました。
ko: %d 개 제공업체를 시도했지만 모두 실패했습니다.
pt_br: Tentamos %d provedores, todos falharam.
ru: Опробовано %d провайдеров, все неудачно.
th: ลอง %d ผู้ให้บริการ ล้มเหลวทั้งหมด
tr: %d sağlayıcı denendi, hepsi başarısız.
vi: Đã thử %d nhà cung cấp, đều thất bại.
zh_hans: 已尝试 %d 个服务商，均失败。
zh_hant: 已嘗試 %d 個服務商，皆失敗。

source: Tried %d providers, all failed. Last error: %@
ar: تمت تجربة %d مزوّدين، فشلوا جميعًا. آخر خطأ: %@
de: %d Anbieter versucht, alle fehlgeschlagen. Letzter Fehler: %@
es: Se intentaron %d proveedores, todos fallaron. Último error: %@
fr: %d fournisseurs essayés, tous ont échoué. Dernière erreur : %@
hi: %d प्रदाताओं को आजमाया, सभी विफल रहे। अंतिम त्रुटि: %@
id: Mencoba %d penyedia, semua gagal. Kesalahan terakhir: %@
ja: %d 個のプロバイダーを試しましたが、すべて失敗しました。最後のエラー: %@
ko: %d 개 제공업체를 시도했지만 모두 실패했습니다. 마지막 오류: %@
pt_br: Tentamos %d provedores, todos falharam. Último erro: %@
ru: Опробовано %d провайдеров, все неудачно. Последняя ошибка: %@
th: ลอง %d ผู้ให้บริการ ล้มเหลวทั้งหมด ข้อผิดพลาดล่าสุด: %@
tr: %d sağlayıcı denendi, hepsi başarısız. Son hata: %@
vi: Đã thử %d nhà cung cấp, đều thất bại. Lỗi cuối: %@
zh_hans: 已尝试 %d 个服务商，均失败。最后错误：%@
zh_hant: 已嘗試 %d 個服務商，皆失敗。最後錯誤：%@

source: Unsaved changes
ar: تغييرات غير محفوظة
de: Nicht gespeicherte Änderungen
es: Cambios sin guardar
fr: Modifications non enregistrées
hi: बिना सहेजे बदलाव
id: Perubahan belum disimpan
ja: 未保存の変更
ko: 저장되지 않은 변경사항
pt_br: Alterações não salvas
ru: Несохранённые изменения
th: การเปลี่ยนแปลงที่ยังไม่บันทึก
tr: Kaydedilmemiş değişiklikler
vi: Thay đổi chưa lưu
zh_hans: 未保存的修改
zh_hant: 未儲存的修改

source: Used in %d conversations
ar: مستخدم في %d محادثة
de: In %d Unterhaltungen verwendet
es: Usado en %d conversaciones
fr: Utilisé dans %d conversations
hi: %d वार्तालापों में उपयोग किया जाता है
id: Digunakan dalam percakapan %d
ja: %d 件の会話で使用中
ko: %d개의 대화에서 사용 중
pt_br: Usado em %d conversas
ru: Используется в разговорах %d.
th: ใช้ในการสนทนา %d
tr: %d konuşmalarında kullanılır
vi: Được sử dụng trong các cuộc hội thoại %d
zh_hans: 已在 %d 个对话中使用
zh_hant: 已在 %d 個對話中使用

source: Write manually
ar: الكتابة يدويًا
de: Manuell schreiben
es: Escribir manualmente
fr: Écrire manuellement
hi: मैन्युअल रूप से लिखें
id: Tulis secara manual
ja: 手動で書く
ko: 직접 작성
pt_br: Escrever manualmente
ru: Написать вручную
th: เขียนด้วยตนเอง
tr: Manuel olarak yaz
vi: Viết thủ công
zh_hans: 手动编写
zh_hant: 手動編寫

source: Write your background and preferences. AI will automatically know this in every conversation — no need to repeat yourself.
ar: اكتب خلفيتك وتفضيلاتك. سيعرف الذكاء الاصطناعي ذلك تلقائيًا في كل محادثة — لا حاجة لتكرار نفسك.
de: Beschreibe deinen Hintergrund und deine Vorlieben. Die KI wird dies in jedem Gespräch automatisch wissen — kein Wiederholen nötig.
es: Escribe tu perfil y preferencias. La IA lo sabrá automáticamente en cada conversación, sin necesidad de repetirte.
fr: Décrivez votre profil et vos préférences. L'IA le saura automatiquement à chaque conversation — inutile de vous répéter.
hi: अपनी पृष्ठभूमि और प्राथमिकताएँ लिखें. एआई को हर बातचीत में यह स्वचालित रूप से पता चल जाएगा - खुद को दोहराने की आवश्यकता नहीं है।
id: Tulis latar belakang dan preferensi Anda. AI akan secara otomatis mengetahui hal ini dalam setiap percakapan — tidak perlu mengulanginya lagi.
ja: あなたの背景や好みを書いてください。AIは毎回の会話で自動的にこれを知ります——繰り返す必要はありません。
ko: 당신의 배경과 선호도를 작성하세요. AI가 모든 대화에서 자동으로 이를 알게 됩니다 — 반복할 필요가 없습니다.
pt_br: Escreva seu perfil e preferências. A IA saberá automaticamente em cada conversa — sem precisar se repetir.
ru: Напишите свой опыт и предпочтения. ИИ будет автоматически знать это в каждом разговоре — не нужно повторяться.
th: เขียนพื้นหลังและความชอบของคุณ AI จะรู้สิ่งนี้โดยอัตโนมัติในทุกการสนทนา ไม่จำเป็นต้องพูดซ้ำ
tr: Geçmişinizi ve tercihlerinizi yazın. Yapay zeka bunu her konuşmada otomatik olarak bilecek; kendinizi tekrarlamanıza gerek yok.
vi: Viết lý lịch và sở thích của bạn. AI sẽ tự động biết điều này trong mọi cuộc trò chuyện - bạn không cần phải lặp lại.
zh_hans: 写下你的背景和偏好，AI 会在每次对话中自动了解这些——无需重复自我介绍。
zh_hant: 寫下你的背景和偏好，AI 會在每次對話中自動了解這些——無需重複自我介紹。

source: You've edited the current text. Apply the generated draft and replace current content?
ar: لقد عدّلت النص الحالي. هل تريد تطبيق المسودة المولّدة واستبدال المحتوى الحالي؟
de: Du hast den aktuellen Text bearbeitet. Generierten Entwurf anwenden und den aktuellen Inhalt ersetzen?
es: Has editado el texto actual. ¿Aplicar el borrador generado y reemplazar el contenido actual?
fr: Vous avez modifié le texte actuel. Appliquer le brouillon généré et remplacer le contenu actuel ?
hi: आपने वर्तमान पाठ संपादित कर दिया है. जनरेट किया गया ड्राफ्ट लागू करें और वर्तमान सामग्री बदलें?
id: Anda telah mengedit teks saat ini. Terapkan draf yang dihasilkan dan ganti konten saat ini?
ja: 現在のテキストを編集しました。生成された下書きを適用して現在の内容を置き換えますか？
ko: 현재 텍스트를 편집했습니다. 생성된 초안을 적용하여 현재 내용을 대체하시겠습니까?
pt_br: Você editou o texto atual. Aplicar o rascunho gerado e substituir o conteúdo atual?
ru: Вы отредактировали текущий текст. Применить созданный черновик и заменить текущий контент?
th: คุณได้แก้ไขข้อความปัจจุบันแล้ว ใช้แบบร่างที่สร้างขึ้นและแทนที่เนื้อหาปัจจุบันหรือไม่
tr: Geçerli metni düzenlediniz. Oluşturulan taslak uygulansın ve mevcut içerik değiştirilsin mi?
vi: Bạn đã chỉnh sửa văn bản hiện tại. Áp dụng bản nháp đã tạo và thay thế nội dung hiện tại?
zh_hans: 你已编辑了当前文本。是否应用生成的草稿并替换当前内容？
zh_hant: 你已編輯了目前的文字。是否套用生成的草稿並取代目前的內容？

source: Advanced
ar: متقدّم
de: Erweitert
es: Avanzado
fr: Avancé
hi: उन्नत
id: Lanjutan
ja: 詳細
ko: 고급
pt_br: Avançado
ru: Дополнительно
th: ขั้นสูง
tr: Gelişmiş
vi: Nâng cao
zh_hans: 高级
zh_hant: 進階

source: Source Code
ar: الكود المصدري
de: Quellcode
es: Código fuente
fr: Code source
hi: सोर्स कोड
id: Kode sumber
ja: ソースコード
ko: 소스 코드
pt_br: Código-fonte
ru: Исходный код
th: ซอร์สโค้ด
tr: Kaynak kodu
vi: Mã nguồn
zh_hans: 源代码
zh_hant: 原始碼

source: Report an Issue
ar: الإبلاغ عن مشكلة
de: Problem melden
es: Informar de un problema
fr: Signaler un problème
hi: समस्या की रिपोर्ट करें
id: Laporkan masalah
ja: 問題を報告
ko: 문제 신고
pt_br: Relatar um problema
ru: Сообщить о проблеме
th: รายงานปัญหา
tr: Sorun bildir
vi: Báo cáo sự cố
zh_hans: 反馈问题
zh_hant: 回報問題

source: API Endpoint
hi: API समापन बिंदु
id: Titik Akhir API
ru: API Конечная точка
th: จุดสิ้นสุด API
tr: API Uç Nokta
vi: Điểm cuối API
